Revit 2027 API
Outline.IsScaleValid Method
 Checks if given scale is valid. Should be greater than zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsScaleValid(
	double scale
)
Public Function IsScaleValid (
	scale As Double
) As Boolean
public:
bool IsScaleValid(
	double scale
)
member IsScaleValid :
        scale : float -> bool
Parameters
scale Double
 The scale.
Return Value
Boolean
 True if the scale is valid, false otherwise.
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace